[
  {
    "title": "Kya 15 Shaban ki raaat ko quran naazil hua tha?",
    "body": " <b>Aaiye jaane ki Qur'an iske baare me kya kehta hai?</b><br/><br/><b>Surat No 2 : سورة البقرة - Ayat No 185<br/> شَہۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡہِ الۡقُرۡاٰنُ </b><br/> Ramzan woh mahina hai jisme Quran utara gaya <br/> Iss Ayat se pata chala k Qur'an, shaban ya aur kisi mahine me nhi balki ramadan me hi nazil hona shuru Hua hai! <br/>Aur mazeed iss raat k baare me Allah ne farmaya:<br/><br/><b>Surat No 44 : سورة الدخان - Ayat No 3 <br/>إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ </b><br/>Hamne ise ek badi khaair aur barkatwali raat mein utara hai<br/> Aur mazeed Allah ne Qur'an me hi uss raat ka bhi zikr kr diya hai balki puri surah hi uss raat k naam pe hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 1 <br/>اِنَّاۤ اَنۡزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾</b><br/> Humne is (Qur'an) ko Shabe-Qadr mein nazil kiya hai.<br/><br/><b>Surat No 97 : سورة القدر - Ayat No 2 <br/>وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾</b><br/> Aur tum kya jaano ki Shabe-Qadr kya hai?<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 3 <br/> لَیۡلَۃُ الۡقَدۡرِ ۬ ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾</b><br/> Shabe-Qadr hazaar mahinon se zyada behtar hai.<br/><br/> <b>Surat No 97 : سورة القدر - Ayat No 4 <br/>تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾</b><br/> Farishte aur rooh usmein apne Rab ke izn se har hukm lekar utarte hain. <br/><br/><b>Surat No 97 : سورة القدر - Ayat No 5<br/> سَلٰم ٌ ۟ ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾</b><br/> Vo raat saraasar salaamati hai, Tulu-e-Fajr tak.<br/> • Qadr kehte hi destiny ko hai, jisme takdeer ke faisle hote hai!<br/><br/> Hadiths me rasulallah ﷺ ne iske baare me aur briefly bataya hai: <br/><br/> <b>Reference Number.1 (Sahih al Bukhari 813) :</b><br/><br/>Narrated Abu Salama: Ek baar main Abu Sa`id Al-Khudri ke paas gaya aur unse poocha, Kya tum hamare saath khajoor ke paidon ke paas baat karne nahi aaoge? Toh Abu Sa`id bahar gaye aur maine unse poocha, Batao ki tumne Nabi se Shab-e-Qadr ke baare mein kya suna? Abu Sa`id ne jawab diya, Ek baar Allah ke Rasool ﷺ ne Ramadan ke pehle das dinon mein I`tikaf kiya aur hmne bhi unke saath wahi kiya. Jibreel (alayhissalam) unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Isi liye Nabi ﷺ ne Ramadan ke beech ke dus dinon mein I`tikaf kiya aur hum bhi unke saath wahi kiye. Jibreel (alayhissalam) phir unke paas aaye aur kaha, 'Woh raat jo tum dhoondh rahe ho, tumhare saamne hai.' Ramadan ke beesve din ke subah Nabi ﷺ ne khutba diya kehte hue, 'Jo bhi log mere saath I`tikaf kar rahe hain, woh ise jaari rakhein. Mujhe Shab-e-Qadr dikhayi gayi thi, lekin uski taarikh bhool gaya, lekin yeh das raaton ki aakhri teeron mein hai. Maine apne khwab mein dekha ke maini kichad aur paani mein sajdah kar raha tha.' Us zamane mein masjid ka chhat khajoor ke paidon ki shaakhon se bani huyi thi. Us waqt aasmaan saaf tha aur koi badal nahi tha, lekin achank ek badal aaya aur baarish hui. Nabi ﷺ ne humein namaz mein imaamat ki aur maine dekha ke Allah ke Rasool ke maathay aur naak par kichad ke nishaan the. Isse woh khwab ka tasdeeq hua. <br/><br/> <b>Reference Number.2 (Sahih al Bukhari 2016):</b> <br/><br/>Narrated Abu Salama: Maine Abu Sa`id se poocha, jo mere dost the, (Shab-e-Qadr ke baare mein) aur unhone kaha, Humne Ramadan ke maheene ke beech mein rasulallah ﷺ ke saath masjid mein I`tikaf kiya. Ramadan ke beesve din ke subah, rasulallah ﷺ aaye aur humein kaha, 'Mujhe (Shab-e-Qadr ki taarikh) ka pata tha lekin mujhe bhoolne ka wajah diya gaya, isliye usse dhundho Ramadan ke das aakhri raaton mein. (Khwab mein) maine apne aapko kichad aur paani mein sajdah karte dekha (ek ishaara ke roop mein). Toh, jo bhi log mere saath I`tikaf mein the, woh mujhse phir I`tikaf karne ke liye wapas aaye', aur hum wapas aaye. Us waqt aasman mein badalon se dhaka hua tha aur baarish hui, aur masjid ke ibtedai imam ki namaz ke jagah se masjid ki chhat se paani nikalne laga jo khajoor ke patte ki shaakhon se bani huyi thi. Fir namaz qayam ki gayi aur maine Allah ke Rasool ko kichad aur paani mein sajdah karte dekha aur unke maathe par kichad ke nishaan dekhe. <br/><br/><b>Reference Number.3 (Sahih al Bukhari 2018):</b><br/><br/> Narrated Abu Sa`id Al-Khudri: Allah ke Rasool Ramadan ke maheene ke beech mein masjid mein I`tikaf karte the aur bees raaton ke guzar jaane ke baad unka ghar jaana hota tha beeswe din, aur unke saath I`tikaf mein jo log hote the, woh bhi apne ghar chale jaate the. Ek baar Ramadan mein, jismein unhone I`tikaf kiya tha, unhone wahi raat ki namaz qayam ki jis raat ko unhe ghar jaana hota tha, aur phir unhone logon se kuch farmaan kiya jo Allah ne unhe farmaane ko chaha aur kaha, 'Main pehle das dinon ke liye I`tikaf karta tha (yani maheene ke beech ke tisre hisse mein) lekin ab main maheene ke aakhri das dinon ke liye I`tikaf karne ka iraada rakhta hoon; isliye jo bhi mere saath I`tikaf mein the, woh apne apne I`tikaf ke maqam par rahen. Mujhe sach mein yeh raat (Shab-e-Qadr ki taarikh) dikhayi gayi thi lekin maine bhool gaya. Isliye isse dhundho is maheene ke das aakhri raaton mein.' Maine bhi apne aapko kichad aur paani mein sajdah karte dekha (khwab mein). Beeswein din ki raat ko aasman badalon se dhaka hua tha aur baarish hui, aur masjid ke upar se paani tapak raha tha jahan Allah ke Rasool (ﷺ) namaaz padhte the. Maine unhe dekha, aur jab unhone fajr ki namaaz padhli, toh unka chehra ganday mitti aur paani se bhig gaya tha. <br/><br/><b> Reference Number.4 (Sahih Muslim 2769): </b><br/><br/> Abu Sa'id al-Khudri ne bataya ki Allah ke Rasool (ﷺ) ne Ramadan ke mahine ke darmiyan 10 raaton ka i'tikaf kiya, aur jab 20 raatein guzar gayi aur bees-e-ek raat ho gayi (21), toh woh apne makaan mein laut gaye aur jo unke saath the, woh bhi apne apne makaanon mein chale gaye. Unhone ek mahine tak ibadat ki. Phir jab woh apne makaan mein wapas aaye, toh raat ko logon se kuch farmaaya jo Allah ki marzi thi, fir farmaya: Maine pehle 10 raaton mein i'tikaf kiya taake woh raat (Lailat-ul-Qadr) talash kar sakoon. Phir maine das dinon ke darmiyan i'tikaf kiya. Phir (ek farishta) mere paas bheja gaya aur mujhe bataya gaya ki yeh (raat) aakhri 10 dinon mein hai. Jo bhi tum mein se i'tikaf karna chahe, woh kar sakta hai; aur log uske saath i'tikaf karte rahe, aur unhone ( rasulallah ﷺ) ne farmaya: Woh (Lailat-ul-Qadr) mujhe ek bepari (raat) mein dikhayi gayi aur maine (khwaab mein dekha) ki main subah mitti aur paani mein sajdah kar raha hoon. Toh beeswein(20) raat ke subah jab woh (Pyare Nabi) fajr ki namaaz ke liye uth gaye, toh baarish hui aur masjid tapak rahi thi, aur maine mitti aur paani dekha. Jab woh subah ki namaaz padh kar bahar aaye (maine dekha) ki unke peshani aur naak ke tip par mitti aur paani ke nishan the, aur woh beeswin(20) raat thi aakhri das raaton mein se.<br/><br/> <b>Reference Number.5 (Sahih Muslim 2777):</b> <br/><br/> Zirr b. Habaish ne riwayat kiya: Maine Ubayy b. Ka'b (r.a.) se poocha: Tumhare bhai (imaan mein) Ibn Mas'ud kehte hain: Jo saal bhar raat ki namaz qayam karta hai, woh Lailat-ul-Qadr ko paata hai, jis par unhone kaha: Allah uspar rahmat farmaye; (unhone ye alfaz is iraade ke saath kaha) taake log sirf ek raat par bharosa na karein, jabki unhe pata tha ki (Lailat-ul-Qadr) Ramadan ke mahine mein hai aur yeh 27th raat hai. Phir unhon ne kasam khayi (bina kisi shart ke, yani ke In sha Allah ke kehne ke bina) ki yeh beeswein satwin raat hai. Maine unse kaha: Abu Mundhir, tum ye kis asal par keh rahe ho? Is par unhon ne kaha: Rasool Allah (ﷺ) ne humein us ishaare ya nishan se bataaya hai, aur woh yeh hai ki us din (suraj) baghair kisi kirne ke niklega.<br/><br/> Mafhoom - Qur'an ki in ayato se yahi pta chalta hai ke Shab-e-qadr , shawwal, shaban ya aur kisi mahine me nhi balki ramadan me hi hai aur ye sahih hadiths iski tasdeek deti h aur unse pta chlta hai ke ye ramadan ke akhri ashre k taak raato me se kisi bhi raat me ho skti h. (Odd nights of ramadan- 21,23,25,27,29).<br/><br/> <b> Aur 15 shaban ko shab e qadr declare krna ekdm nonsense si baat hai aur iska jawaz kahi Qur'an aur sunnat me nhi milta hai ye sbh bs kahaniya hai!</b>"
  },
  {
    "title": "Kya 15 Shaban ko khaas taur se roza rkhna sunnat se sabit hai? ",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 Shaban ko kabristan me jaa kr candles/agarbattiyan Lgana sunnat se sabit hai",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko Allah duniya ke akhri aasmaan pe aata hai aur logon ki farmata hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ki raat ko khaas taur se zyada ibadat karne ka zyada sawaab hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya 15 shaban ko khaas taur se halwa bnana aur sbko khilana sunnat se sabit hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Kya iss raat naama-e-amaal Allah k huzur pesh hote hai?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "What is innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  },
  {
    "title": "Why is celebrating Shab-e-Baraat an innovation(bid'ah)?",
    "body": "It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout."
  }
]
